## Plan Result (sbox_landing - TerraformPlanApply)




<pre><code>Plan: 10 to add, 8 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;09-ingest09-di001-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-di002-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-dp001-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-dp002-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;09-ingest09-management-sbox-User-Owner-alex.bance@justice.gov.uk&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;management&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-user-inbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-user-inbound&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.metadata_mssql.azurerm_mssql_server.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["09-ingest09-di001-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-di002-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-dp001-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-dp002-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["09-ingest09-management-sbox-User-Owner-alex.bance@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f11e5e9-83e3-442f-a015-a6bda75912cd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["di001"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-di001-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["di002"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-di002-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["dp001"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-dp001-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["dp002"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-dp002-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["management"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-management-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Test Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Owners (sub:dts-dataingest-sbox)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox"
        name                                         = "ingest00-metadata-mssql-sbox"
        tags                                         = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "35996ac2-2097-4f8f-b271-313f29c43141" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-user-inbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
        id                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/networkSecurityGroups/ingest00-bastion-nsg-sbox/securityRules/bastion-nsg-Bastion-user-inbound"
        name                                       = "bastion-nsg-Bastion-user-inbound"
      ~ source_address_prefixes                    = [
          - "194.33.192.0/24",
          - "194.33.196.0/24",
          - "194.33.248.0/24",
          - "194.33.249.0/24",
          + "*",
        ]
        # (16 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Owners (sub:dts-dataingest-sbox)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Sql/servers/ingest01-metadata-mssql-sbox/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Sql/servers/ingest01-metadata-mssql-sbox"
        name                                         = "ingest01-metadata-mssql-sbox"
        tags                                         = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "35996ac2-2097-4f8f-b271-313f29c43141" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-user-inbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
        id                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/networkSecurityGroups/ingest01-bastion-nsg-sbox/securityRules/bastion-nsg-Bastion-user-inbound"
        name                                       = "bastion-nsg-Bastion-user-inbound"
      - source_address_prefix                      = "*" -> null
      33m~ source_address_prefixes                    = [
          + "*",
        ]
        # (15 unchanged attributes hidden)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Owners (sub:dts-dataingest-sbox)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-metadata-sbox/providers/Microsoft.Sql/servers/ingest09-metadata-mssql-sbox/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-metadata-sbox/providers/Microsoft.Sql/servers/ingest09-metadata-mssql-sbox"
        name                                         = "ingest09-metadata-mssql-sbox"
        tags                                         = {
            "Data-Ingest-Project" = "AJB Test Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "35996ac2-2097-4f8f-b271-313f29c43141" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["09"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["09"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["09"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["09"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 10 to add, 8 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":83,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->